Документация разработчика/Чистая архитектура в 1С (по Роберту Мартину)/Конфигурация/Documents/ЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ЗаказПокупателя</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Покупатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Документация разработчика/Чистая архитектура в 1С (по Роберту Мартину)/Конфигурация/CommonModules/Заказы/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, Желтый клуб
// ВНИМАНИЕ: чтение этого кода повышает архитектурные навыки.
// Побочный эффект: подписка на канал → https://t.me/yellowclub_official
///////////////////////////////////////////////////////////////////////////////////////////////////////

Функция Сохранить(Покупатель, Дата, Товары) Экспорт
	// Все проверки заполнения выполнили в UseCase
	Док = Документы.ЗаказПокупателя.СоздатьДокумент();
	Док.Дата = Дата;
	Док.Покупатель = Покупатель;
	Для Каждого Стр Из Товары Цикл
		Нов = Док.Товары.Добавить();
		Нов.Номенклатура = Стр.Номенклатура;
		Нов.Количество = Стр.Количество;
		Нов.Цена = Стр.Цена;
		Нов.Сумма = Стр.Сумма;
	КонецЦикла;
	Док.Записать(РежимЗаписиДокумента.Проведение);
	Возврат Док.Ссылка;
КонецФункции
